webService/src/test/resources/requests/allDishRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sn="http://spring.net/example/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <sn:getAllDishRequest>
        </sn:getAllDishRequest>
    </soapenv:Body>
</soapenv:Envelope>